# Create a DataFrame from List

In [9]:
import pandas as pd

In [15]:
student_data=[[1,"Ben",15],[2,"Arya",11],[3,"Tony",11],[4,"Ray",20]]

In [16]:
student_df = pd.DataFrame(student_data, columns=['student_id','name','age'])
student_df

   student_id  name  age
0           1   Ben   15
1           2  Arya   11
2           3  Tony   11
3           4   Ray   20

# Get the Size of a DataFrame

Return the result as an array:

[number of rows, number of columns]

In [17]:
list(student_df.shape)

[4, 3]

# Display the First Three Rows

In [18]:
student_df.iloc[0:3]

   student_id  name  age
0           1   Ben   15
1           2  Arya   11
2           3  Tony   11

In [19]:
student_df.head(3)

   student_id  name  age
0           1   Ben   15
1           2  Arya   11
2           3  Tony   11

# Select data

Write a solution to select the name and age of the student with student_id = 4

In [23]:
student_df[student_df['student_id']==4][['name','age']]

  name  age
3  Ray   20

# Create a new column

In [49]:
emp_data = {'Name': ['Piper', 'Grace', 'Georgia', 'Will'],
        'Salary': [5100, 4548, 6234, 23456]}
emp_df = pd.DataFrame(emp_data)

In [29]:
def createBonusColumn(employees: pd.DataFrame) -> pd.DataFrame:
    employees['bonus'] = [2*x for x in employees['Salary']]
    return employees

In [30]:
print(createBonusColumn(emp_df))

      Name  Salary  bonus
0    Piper    5100  10200
1    Grace    4548   9096
2  Georgia    6234  12468
3     Will   23456  46912

# Drop duplicate rows

In [36]:
emails = ['ben@gmail.com','arya@gmail.com','tony@gmail.com','tony@gmail.com']
student_df['email'] = emails
student_df

   student_id  name  age           email
0           1   Ben   15   ben@gmail.com
1           2  Arya   11  arya@gmail.com
2           3  Tony   11  tony@gmail.com
3           4   Ray   20  tony@gmail.com

In [37]:
student_df.drop_duplicates(subset=['email'],inplace=True)
student_df

   student_id  name  age           email
0           1   Ben   15   ben@gmail.com
1           2  Arya   11  arya@gmail.com
2           3  Tony   11  tony@gmail.com

# Drop missing data

In [38]:
student_df.dropna(subset=['name'],inplace=True)

# Modify columns

In [42]:
student_df['name'] = student_df['name'].str.upper()
student_df

   student_id  name  age           email
0           1   BEN   15   ben@gmail.com
1           2  ARYA   11  arya@gmail.com
2           3  TONY   11  tony@gmail.com

# Rename columns

In [43]:
student_df.rename(columns = {'student_id':'ID', 'name':'first_name', 'age':'age_in_years'},inplace = True)
student_df

   ID first_name  age_in_years           email
0   1        BEN            15   ben@gmail.com
1   2       ARYA            11  arya@gmail.com
2   3       TONY            11  tony@gmail.com

# Change data type

In [51]:
emp_df['Salary'] = emp_df['Salary'].astype(float)

In [52]:
emp_df.dtypes

Name       object
Salary    float64
dtype: object